Se revisan la forma de unir dataFrames con pandas.

###### 1. Preparando los datos para unir

###### 2. Concatenando datos 

    pd.concat ; Concatena de forma horizontal o vertical
    
    pd.append ; Concatena y Agrega los datos

###### 3. Union de datos

    pd.merge ; Cruze de datos por medio de una llave

    pd.add ; Agrega los datos

    pd.join ; Uniones de datos (left, right, union, inner, etc)
    
###### 4. Caso de uso
    
    Leer y unir varios conjuntos de datos en una misma base de datos, dependiendo la situaci√≥n.

# Preparando los datos

In [103]:
import os
import pandas as pd

In [104]:
#Ruta actual
os.getcwd()

'C:\\Users\\admin\\Documents\\Bases\\Summer Olympic medals\\Summer Olympic medals'

In [105]:
#Cambio de Ruta
os.chdir("C:/Users/admin/Documents/Bases/Summer Olympic medals/Summer Olympic medals")

In [106]:
#Archivos en Ruta
os.listdir()

['Bronze.csv',
 'bronze_top5.csv',
 'Gold.csv',
 'gold_top5.csv',
 'Silver.csv',
 'silver_top5.csv',
 'Summer Olympic medalists 1896 to 2008 - ALL MEDALISTS.tsv',
 'Summer Olympic medalists 1896 to 2008 - EDITIONS.tsv',
 'Summer Olympic medalists 1896 to 2008 - IOC COUNTRY CODES.csv']

In [107]:
#Lectura de Archivos
gold = pd.read_csv('Gold.csv')
gold.shape

(138, 3)

Para leer varios archivos de forma multiple crearemos un for, cada uno se guardara como elemento de una lista

In [108]:
filenames = ['Gold.csv','Silver.csv','Bronze.csv']

dataframes = []

for filename in filenames:
    dataframes.append(pd.read_csv(filename))
    
type(dataframes)

list

In [109]:
#Primer dataset de la lista
print(dataframes[0].head())
dataframes[0].shape

   NOC         Country   Total
0  USA   United States  2088.0
1  URS    Soviet Union   838.0
2  GBR  United Kingdom   498.0
3  FRA          France   378.0
4  GER         Germany   407.0

(138, 3)

In [110]:
#Correspondecia de los elementos de la lista
gold = dataframes[0]
silver = dataframes[1]
bronze = dataframes[2]

Combinando todo en un dataFrame

In [111]:
medals = gold.copy()

new_labels = ['NOC', 'Country', 'Gold']

medals.columns = new_labels

medals['Silver'] = dataframes[1]['Total']
medals['Bronze'] = dataframes[2]['Total']

medals.head()

   NOC         Country    Gold  Silver  Bronze
0  USA   United States  2088.0  1195.0  1052.0
1  URS    Soviet Union   838.0   627.0   584.0
2  GBR  United Kingdom   498.0   591.0   505.0
3  FRA          France   378.0   461.0   475.0
4  GER         Germany   407.0   350.0   454.0

In [112]:
bronze.head()

   NOC         Country   Total
0  USA   United States  1052.0
1  URS    Soviet Union   584.0
2  GBR  United Kingdom   505.0
3  FRA          France   475.0
4  GER         Germany   454.0

In [113]:
#Suma de las todas las medallas, bronze, silver y gold
bronze.add(silver, fill_value=0).add(gold, fill_value=0).head()

         NOC                                     Country   Total
0  USAUSAUSA     United StatesUnited StatesUnited States  4335.0
1  URSURSURS        Soviet UnionSoviet UnionSoviet Union  2049.0
2  GBRGBRGBR  United KingdomUnited KingdomUnited Kingdom  1594.0
3  FRAFRAFRA                          FranceFranceFrance  1314.0
4  GERGERGER                       GermanyGermanyGermany  1211.0

Clasificacion por medio de indice y columnas, para que los valores numericos queden libres.

In [114]:
medals.index = medals[['NOC','Country']]
medals = medals[['Gold','Silver','Bronze']]
medals.sort_index(ascending=True).head()

                              Gold  Silver  Bronze
(AFG, Afghanistan)             NaN     NaN     1.0
(AHO, Netherlands Antilles*)   NaN     1.0     NaN
(ALG, Algeria)                 4.0     2.0     8.0
(ANZ, Australasia)            20.0     4.0     5.0
(ARG, Argentina)              68.0    83.0    88.0

In [115]:
medals.sort_values('Silver', ascending=False).head()

                         Gold  Silver  Bronze
(USA, United States)   2088.0  1195.0  1052.0
(URS, Soviet Union)     838.0   627.0   584.0
(GBR, United Kingdom)   498.0   591.0   505.0
(FRA, France)           378.0   461.0   475.0
(ITA, Italy)            460.0   394.0   374.0

Aritmetica Series y DataFrames

In [116]:
#Porcentaje de medallas respecto al total
medals_percentage = medals / medals.sum(axis = 0)

medals_percentage.head()

                           Gold    Silver    Bronze
(USA, United States)   0.211980  0.123489  0.108577
(URS, Soviet Union)    0.085076  0.064793  0.060275
(GBR, United Kingdom)  0.050558  0.061073  0.052121
(FRA, France)          0.038376  0.047639  0.049025
(GER, Germany)         0.041320  0.036168  0.046857

Resumenes por Fecha

In [117]:
os.chdir("C:/Users/admin/Documents/Bases/Sales/Sales")
os.listdir()

['feb-sales-Hardware.csv',
 'feb-sales-Service.csv',
 'feb-sales-Software.csv',
 'sales-feb-2015.csv',
 'sales-jan-2015.csv',
 'sales-mar-2015.csv']

In [118]:
#Jalar datos por comprension
filenames = ['sales-feb-2015.csv','sales-jan-2015.csv','sales-mar-2015.csv']

dataframes = [pd.read_csv(f) for f in filenames]

dataframes[0].head()

                  Date    Company   Product  Units
0  2015-02-26 08:57:45  Streeplex   Service      4
1  2015-02-16 12:09:19      Hooli  Software     10
2  2015-02-03 14:14:18    Initech  Software     13
3  2015-02-02 08:33:01      Hooli  Software      3
4  2015-02-25 00:29:00    Initech   Service     10

In [119]:
#Jalar datos por variables globales
from glob import glob

filenames = glob('sales*.csv')

dataframes = [pd.read_csv(f) for f in filenames]

In [120]:
sales_union = pd.concat([dataframes[0],dataframes[1], dataframes[2]])
sales_union.head()

                  Date    Company   Product  Units
0  2015-02-26 08:57:45  Streeplex   Service      4
1  2015-02-16 12:09:19      Hooli  Software     10
2  2015-02-03 14:14:18    Initech  Software     13
3  2015-02-02 08:33:01      Hooli  Software      3
4  2015-02-25 00:29:00    Initech   Service     10

In [121]:
#Formato del index
a = pd.to_datetime(sales_union['Date'])

In [122]:
sales_union.index = a
#Resumen por Mes
sales_union.resample('M').sum()

            Units
Date
2015-01-31    248
2015-02-28    176
2015-03-31    218

In [123]:
#Ultimos dias de cada Mes
sales_union.resample('M').last()

                           Date          Company  Product  Units
Date
2015-01-31  2015-01-27 07:11:55        Streeplex  Service     18
2015-02-28  2015-02-26 08:58:51        Streeplex  Service      1
2015-03-31  2015-03-28 19:20:38  Acme Coporation  Service      5

In [124]:
#Porcentaje de cambio respecto al valor actual y el anterior
sales_union.resample('M').sum().pct_change()*100

                Units
Date
2015-01-31        NaN
2015-02-28 -29.032258
2015-03-31  23.863636

In [125]:
#Metodo .multiply multiplica la columma Units por 10
sales_union['sales_10'] = sales_union.Units.multiply(10, axis = 'rows')
sales_union.head()

                                    Date    Company   Product  Units  sales_10
Date
2015-02-26 08:57:45  2015-02-26 08:57:45  Streeplex   Service      4        40
2015-02-16 12:09:19  2015-02-16 12:09:19      Hooli  Software     10       100
2015-02-03 14:14:18  2015-02-03 14:14:18    Initech  Software     13       130
2015-02-02 08:33:01  2015-02-02 08:33:01      Hooli  Software      3        30
2015-02-25 00:29:00  2015-02-25 00:29:00    Initech   Service     10       100

# Concatenando Datos

Agregar y concatenar Series (.append, .concat)

In [126]:
bronze.shape

(138, 3)

In [127]:
#.append, si las bases tienen el mismo nombre de columnas, concatena de forma vertical
combinacion = bronze.append(silver)
combinacion.shape

(276, 3)

In [128]:
#Bases elemento de la lista dataframes
jan = dataframes[0]
feb = dataframes[1]
mar = dataframes[2]

jan.shape

(20, 4)

In [129]:
#Podemos ir combinando los datos, el parametro ignore_index = True ayuda a eliminar la indexacion pasada.
combinacion = jan.append(feb,ignore_index=True).append(mar,ignore_index=True)
combinacion.shape

(60, 4)

In [130]:
combinacion.head(1)

                  Date    Company  Product  Units
0  2015-02-26 08:57:45  Streeplex  Service      4

In [131]:
combinacion.tail(1)

                   Date    Company   Product  Units
59  2015-03-13 16:25:24  Streeplex  Software      9

Diferencia .append y .concat

In [132]:
#Concate permite no solo unir los datos de manera vertival si no tambien horizontal que es una diferencia contra .append()
pd.concat([jan, feb, mar], axis=1).head()

,Date,Company,Product,Units,Date,Company,Product,Units,Date,Company,Product,Units
0,2015-02-26 08:57:45,Streeplex,Service,4,2015-01-21 19:13:21,Streeplex,Hardware,11,2015-03-22 14:42:25,Mediacore,Software,6
1,2015-02-16 12:09:19,Hooli,Software,10,2015-01-09 05:23:51,Streeplex,Service,8,2015-03-12 18:33:06,Initech,Service,19
2,2015-02-03 14:14:18,Initech,Software,13,2015-01-06 17:19:34,Initech,Hardware,17,2015-03-22 03:58:28,Streeplex,Software,8
3,2015-02-02 08:33:01,Hooli,Software,3,2015-01-02 09:51:06,Hooli,Hardware,16,2015-03-15 00:53:12,Hooli,Hardware,19
4,2015-02-25 00:29:00,Initech,Service,10,2015-01-11 14:51:02,Hooli,Hardware,11,2015-03-17 19:25:37,Hooli,Hardware,10

In [133]:
#Union de los dos metodos
units = []
#Une los elementos en una lista units
for month in [jan, feb, mar]:
    units.append(month['Units'])
#Concatena los elementos de la lista units    
combinacion = pd.concat(units, axis = "rows")    
combinacion.shape

(60,)

Leer varios Archivos para construir un DataFrame

In [134]:
os.chdir("C:/Users/admin/Documents/Bases/Summer Olympic medals/Summer Olympic medals")

medal_types = ['bronze', 'silver', 'gold']
medals = []

for medal in medal_types:
    file_name = "%s_top5.csv" % medal
    columns = ['Country', medal]
    medal_df = pd.read_csv(file_name, header=0, index_col='Country', names=columns)
    medals.append(medal_df)
#axis = 0 no respeta el index, con axis = 'columns' macheamos por el nombre de las filas
medals = pd.concat(medals, axis='columns')
print(medals)

                bronze  silver    gold
France           475.0   461.0     NaN
Germany          454.0     NaN   407.0
Italy              NaN   394.0   460.0
Soviet Union     584.0   627.0   838.0
United Kingdom   505.0   591.0   498.0
United States   1052.0  1195.0  2088.0

C:\Users\admin\Anaconda3\lib\site-packages\ipykernel_launcher.py:12: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=True'.

To retain the current behavior and silence the warning, pass sort=False

  if sys.path[0] == '':

Trabajando con Index y Multindex. 

Tienen su utilidad para resumir y agrupar informacion.

In [135]:
#Concatenamos las bases, especificando el index de medalla
medals = pd.concat([gold,bronze, silver], keys= ['bronze', 'silver', 'gold'], axis=0, ignore_index=False)
medals.head()

          NOC         Country   Total
bronze 0  USA   United States  2088.0
       1  URS    Soviet Union   838.0
       2  GBR  United Kingdom   498.0
       3  FRA          France   378.0
       4  GER         Germany   407.0

In [136]:
#Reseteamos los index para que sean valores de una columna
medals = medals.reset_index()
medals.head()

  level_0  level_1  NOC         Country   Total
0  bronze        0  USA   United States  2088.0
1  bronze        1  URS    Soviet Union   838.0
2  bronze        2  GBR  United Kingdom   498.0
3  bronze        3  FRA          France   378.0
4  bronze        4  GER         Germany   407.0

In [137]:
#Definimos los nuevos index
medals.set_index(['level_0','Country','NOC'], inplace = True)
medals = pd.DataFrame(medals.Total)

In [138]:
medals.head()

                             Total
level_0 Country        NOC
bronze  United States  USA  2088.0
        Soviet Union   URS   838.0
        United Kingdom GBR   498.0
        France         FRA   378.0
        Germany        GER   407.0

In [139]:
#Ordena por el segundo nivel de index
medals_sorted = medals.sort_index(level = 2)
medals_sorted.head()

                                   Total
level_0 Country               NOC
bronze  Afghanistan           AFG    NaN
gold    Afghanistan           AFG    NaN
silver  Afghanistan           AFG    1.0
bronze  Netherlands Antilles* AHO    NaN
gold    Netherlands Antilles* AHO    1.0

In [140]:
#Seleccion de datos por medio de Index
idx = pd.IndexSlice
medals_sorted.loc[idx[:,'Mexico'],:]

                     Total
level_0 Country NOC
bronze  Mexico  MEX   14.0
gold    Mexico  MEX   18.0
silver  Mexico  MEX   48.0

Con el siguiente codigo se ejemplifica como hacer resumenes de la informacion, partiendo de tener los valores en listas y concatenandolos.

In [141]:
#Unimos las bases en una lista etiquetandolas.
month_list = [('januray',jan), ('february', feb), ('march', mar)]
month_dict = {}

In [142]:
#Resumen de las Mentas Mensuales por Company
for month_name, month_data in month_list:

    # Toma el nombre del mes de la lista y agrupa por Company
    month_dict[month_name] = month_data.groupby('Company').sum()

# Concatena los valores en el mont_dict
sales = pd.concat(month_dict)

print(sales)

                          Units
         Company
february Acme Coporation     76
         Hooli               70
         Initech             37
         Mediacore           15
         Streeplex           50
januray  Acme Coporation     34
         Hooli               30
         Initech             30
         Mediacore           45
         Streeplex           37
march    Acme Coporation      5
         Hooli               37
         Initech             68
         Mediacore           68
         Streeplex           40

In [143]:
#Seleccion por medio del Indice.
idx = pd.IndexSlice
print(sales.loc[idx[:, 'Mediacore'], :])

                    Units
         Company
february Mediacore     15
januray  Mediacore     45
march    Mediacore     68

Outer e Inner Joins

In [144]:
#Iner Join, une todo de forma de interseccion
medal_list = [bronze, silver, gold]

# Concatenando de manera horizontal
medals = pd.concat(medal_list, keys=['bronze', 'silver', 'gold'], axis=1, join='inner')

medals.head(3)

  bronze                         silver                         gold  \
     NOC         Country   Total    NOC         Country   Total  NOC
0    USA   United States  1052.0    USA   United States  1195.0  USA
1    URS    Soviet Union   584.0    URS    Soviet Union   627.0  URS
2    GBR  United Kingdom   505.0    GBR  United Kingdom   591.0  GBR


          Country   Total
0   United States  2088.0
1    Soviet Union   838.0
2  United Kingdom   498.0

# Merge DataFrames

In [145]:
#Une solo las filas que son iguales
Union = pd.merge(bronze, gold)
Union.shape

(18, 3)

In [146]:
#Une por las coincidencias de la fila NOC
Union = pd.merge(bronze, gold, on = 'NOC')
Union.head()

   NOC       Country_x  Total_x       Country_y  Total_y
0  USA   United States   1052.0   United States   2088.0
1  URS    Soviet Union    584.0    Soviet Union    838.0
2  GBR  United Kingdom    505.0  United Kingdom    498.0
3  FRA          France    475.0          France    378.0
4  GER         Germany    454.0         Germany    407.0

In [147]:
#Une por multiples llaves y adicional se colocan los nombres de las demas columnas
Union = pd.merge(bronze, gold, on = ['NOC','Country'], suffixes=['_Bronze','_gold'])
Union.head()

   NOC         Country  Total_Bronze  Total_gold
0  USA   United States        1052.0      2088.0
1  URS    Soviet Union         584.0       838.0
2  GBR  United Kingdom         505.0       498.0
3  FRA          France         475.0       378.0
4  GER         Germany         454.0       407.0

In [148]:
#Union por nombre de columnas distintos
gold_ = gold
gold_.columns = ['ABR','PAIS','GOLD'] #Cambio del nombre de las columnas gold

pd.merge(gold_, bronze, left_on='ABR', right_on='NOC').head()

   ABR            PAIS    GOLD  NOC         Country   Total
0  USA   United States  2088.0  USA   United States  1052.0
1  URS    Soviet Union   838.0  URS    Soviet Union   584.0
2  GBR  United Kingdom   498.0  GBR  United Kingdom   505.0
3  FRA          France   378.0  FRA          France   475.0
4  GER         Germany   407.0  GER         Germany   454.0

Union de DataFrames (left, right, union)

In [149]:
gold_ = gold.iloc[1:10,:]
gold_

   ABR            PAIS   GOLD
1  URS    Soviet Union  838.0
2  GBR  United Kingdom  498.0
3  FRA          France  378.0
4  GER         Germany  407.0
5  AUS       Australia  293.0
6  ITA           Italy  460.0
7  HUN         Hungary  400.0
8  SWE          Sweden  347.0
9  NED     Netherlands  212.0

In [156]:
gold.keys()

Index(['ABR', 'PAIS', 'GOLD'], dtype='object')

In [158]:
#Union con inner Join , interseccion 
pd.merge(bronze, gold , left_on= ['NOC','Country'],right_on=['ABR','PAIS'], suffixes=['_Bronze','_gold'], how = 'inner').head()

   NOC         Country   Total  ABR            PAIS    GOLD
0  USA   United States  1052.0  USA   United States  2088.0
1  URS    Soviet Union   584.0  URS    Soviet Union   838.0
2  GBR  United Kingdom   505.0  GBR  United Kingdom   498.0
3  FRA          France   475.0  FRA          France   378.0
4  GER         Germany   454.0  GER         Germany   407.0

In [690]:
#Union con left join, respeta lo de la base izquierda
pd.merge(bronze, gold_, on = ['NOC','Country'], suffixes=['_Bronze','_gold'], how = 'left').head(11)

    NOC         Country  Total_Bronze  Total_gold
0   USA   United States        1052.0         NaN
1   URS    Soviet Union         584.0       838.0
2   GBR  United Kingdom         505.0       498.0
3   FRA          France         475.0       378.0
4   GER         Germany         454.0       407.0
5   AUS       Australia         413.0       293.0
6   ITA           Italy         374.0       460.0
7   HUN         Hungary         345.0       400.0
8   SWE          Sweden         325.0       347.0
9   NED     Netherlands         320.0       212.0
10  ROU         Romania         282.0         NaN

In [692]:
#Union con right join, respeta lo de la base derecha
pd.merge(bronze, gold_, on = ['NOC','Country'], suffixes=['_Bronze','_gold'], how = 'right').head(11)

   NOC         Country  Total_Bronze  Total_gold
0  URS    Soviet Union         584.0       838.0
1  GBR  United Kingdom         505.0       498.0
2  FRA          France         475.0       378.0
3  GER         Germany         454.0       407.0
4  AUS       Australia         413.0       293.0
5  ITA           Italy         374.0       460.0
6  HUN         Hungary         345.0       400.0
7  SWE          Sweden         325.0       347.0
8  NED     Netherlands         320.0       212.0

In [695]:
#Union con Outer join, respeta todas las coincidencias
pd.merge(bronze, gold_, on = ['NOC','Country'], suffixes=['_Bronze','_gold'], how = 'outer').shape

(138, 4)

In [38]:
#Ordena por Nombre
pd.merge_ordered(bronze, gold, on = 'NOC', suffixes = ['_bronze','_gold']).head()

   NOC         Country_bronze  Total_bronze           Country_gold  Total_gold
0  AFG            Afghanistan           1.0            Afghanistan         NaN
1  AHO  Netherlands Antilles*           NaN  Netherlands Antilles*         NaN
2  ALG                Algeria           8.0                Algeria         4.0
3  ANZ            Australasia           5.0            Australasia        20.0
4  ARG              Argentina          88.0              Argentina        68.0

Metodo Join DataFrames, es como especificar en un merge solo que con otra sintaxis

In [23]:
#Interseccion de los datos
bronze.join(gold,rsuffix='NOC',lsuffix='NOC', how = 'outer').head()

  NOCNOC      CountryNOC  TotalNOC NOCNOC      CountryNOC  TotalNOC
0    USA   United States    1052.0    USA   United States    2088.0
1    URS    Soviet Union     584.0    URS    Soviet Union     838.0
2    GBR  United Kingdom     505.0    GBR  United Kingdom     498.0
3    FRA          France     475.0    FRA          France     378.0
4    GER         Germany     454.0    GER         Germany     407.0

In [27]:
#Union solo con el lado izquiedo de los datos
bronze.loc[1:10].join(gold, rsuffix = 'NOC', lsuffix = 'NOC', how = 'left')

   NOCNOC      CountryNOC  TotalNOC NOCNOC      CountryNOC  TotalNOC
1     URS    Soviet Union     584.0    URS    Soviet Union     838.0
2     GBR  United Kingdom     505.0    GBR  United Kingdom     498.0
3     FRA          France     475.0    FRA          France     378.0
4     GER         Germany     454.0    GER         Germany     407.0
5     AUS       Australia     413.0    AUS       Australia     293.0
6     ITA           Italy     374.0    ITA           Italy     460.0
7     HUN         Hungary     345.0    HUN         Hungary     400.0
8     SWE          Sweden     325.0    SWE          Sweden     347.0
9     NED     Netherlands     320.0    NED     Netherlands     212.0
10    ROU         Romania     282.0    ROU         Romania     155.0

# Casos Particulares

Lemos el archivo Summer Olympics y ocupamos la columna year para un for y leer los archivos adicionales

In [184]:
os.chdir("C:/Users/admin/Documents/Bases/Summer Olympic medals/Summer Olympic medals")
os.listdir()

['Bronze.csv',
 'bronze_top5.csv',
 'Gold.csv',
 'gold_top5.csv',
 'Silver.csv',
 'silver_top5.csv',
 'Summer Olympic medalists 1896 to 2008 - ALL MEDALISTS.tsv',
 'Summer Olympic medalists 1896 to 2008 - EDITIONS.tsv',
 'Summer Olympic medalists 1896 to 2008 - IOC COUNTRY CODES.csv']

In [199]:
file_path = 'Summer Olympic medalists 1896 to 2008 - EDITIONS.tsv'
editions = pd.read_csv(file_path, sep='\t')
editions = editions[['Edition', 'Grand Total', 'City', 'Country']]
editions.head()

   Edition  Grand Total       City         Country
0     1896          151     Athens          Greece
1     1900          512      Paris          France
2     1904          470  St. Louis   United States
3     1908          804     London  United Kingdom
4     1912          885  Stockholm          Sweden

In [201]:
file_path = 'Summer Olympic medalists 1896 to 2008 - IOC COUNTRY CODES.csv'
ioc_codes = pd.read_csv(file_path)
ioc_codes = ioc_codes[['Country', 'NOC']]
print(ioc_codes.head())

print(ioc_codes.tail())

           Country  NOC
0      Afghanistan  AFG
1          Albania  ALB
2          Algeria  ALG
3  American Samoa*  ASA
4          Andorra  AND
             Country  NOC
196          Vietnam  VIE
197  Virgin Islands*  ISV
198            Yemen  YEM
199           Zambia  ZAM
200         Zimbabwe  ZIM

In [ ]:
#El siguiente for lee los archivos por a√±o de una ruta, guardanndolos y etiquetandolos en un diccionario para convertir a dataframe
medals_dict = {}

for year in editions['Edition']: #Se reccore por las Ediciones que se han realizado

    #Creamos un path dinamico, cambia de acuerdo a la variable year
    file_path = 'summer_{:d}.csv'.format(year)
    
    #Almacenamos en el diccionario
    medals_dict[year] = pd.read_csv(file_path)
    
    # Extraemos las columnas relevantes
    medals_dict[year] = medals_dict[year][['Athlete','NOC','Medal']]
    
    #Asignamos la etiqueta de la base al diccionario
    medals_dict[year]['Edition'] = year
    
#Ya con la etiqueta en el diccionario se crea la columna edition
medals = pd.concat(medals_dict, ignore_index=True)

# Print first and last 5 rows of medals
print(medals.head())
print(medals.tail())

# Tabla dinamica

In [212]:
sales_union.head(1)

                                    Date    Company  Product  Units  sales_10
Date
2015-02-26 08:57:45  2015-02-26 08:57:45  Streeplex  Service      4        40

In [214]:
sales_count = sales_union.pivot_table(index = 'Product',values='Units',columns='Company',aggfunc='sum')
sales_count

Company   Acme Coporation  Hooli  Initech  Mediacore  Streeplex
Product
Hardware               27     84       55         51         31
Service                21     36       48         18         50
Software               67     17       32         59         46

In [223]:
sales_count.expanding().sum()

Company   Acme Coporation  Hooli  Initech  Mediacore  Streeplex
Product
Hardware             27.0   84.0     55.0       51.0       31.0
Service              48.0  120.0    103.0       69.0       81.0
Software            115.0  137.0    135.0      128.0      127.0